/*
ผู้จัดเกมปริศนานามแฝงว่า "Skul1" ได้จับนักโทษมาเล่นเกมโดยบอกว่าผู้ชนะจะมีเพียงหนึ่งคน โดยผู้ชนะจะเป็นอิสระและได้รับเงินมหาศาล
โดยกฏของเกมมีอยู่ว่า จะให้จำนวนนักโทษนั้งเป็นวงกลม จำนวน N คน คนที่เริ่มตำแหน่งที่ 1 จะทำการสังหารคนถัดไปคือ ตำแหน่งคนที่ 2 
แล้วคนที่มีชีวิตรอดต่อจากคนถัดไป(ตำแหน่งคนที่ 3) สังหารคนถัดไป(ตำแหน่งคนที่ 4) วนไปเรื่อยๆจนเหลือคนสุดท้าย คนสุดท้ายที่รอดจะเป็นผู้ชนะของเกมนั้น
แต่ "Skul1" นึกแผนชั่วขึ้นมา โดยส่ง spy ไปนั้งตำแหน่งของผู้ชนะ เพื่อที่จะประหารนั้งโทษให้หมด เป็นกลอุบาย
"ฉันจะให้ล้านนึง เจ้าเขียนโปรแกรมหาตำแหน่งของผู้ชนะของเกมนี้ ในฐานะมือขวาของข้าขอให้เป็นความลับระหว่างพวกเรา" Skul1 กล่าวไว้
ข้อมูลเข้า
    N คือ จำนวนเก้าอี้ โดย 2<=N<=10000(ถ้าผู้ใช้พิมพ์ N > 10000 หรือ N < 2 ให้พิมพ์ว่า ERROR)
ข้อมูลออก
    x คือ ตำแหน่งที่เป็นผู้ชนะ
ยกตัวอย่าง
    N = 12
    โดยลำดับของตำแหน่งที่ถูกสังการคือ
    1->2 3->4 5->6 7->8 9->10 11->12
    1->3 5->7 9->11
    1->5 9->1
    9 เป็นจำแหน่งสุดท้ายที่อยู่รอดเลยเป็นผู้ชนะ
*/
//Math in Josephus's Problem O(1)
#include<iostream>
#include<cmath>
using namespace std;
int findSafeSpot(int num)
{
    return 2*(num-pow(2,floor(log10(num)/log10(2))))+1;
}
main()
{
    int num;
    cin >> num;
    if(num < 2 || num > 10000)
    {
        cout << "ERROR" << endl;
    }
    else
    {
        cout << findSafeSpot(num) << endl;
    }
}